In [10]:
from pandas import Series
ser = Series([1,3,2,4,6,5],index=[2,4,5,1,6,3])
ser

2    1
4    3
5    2
1    4
6    6
3    5
dtype: int64

In [4]:
ser.sort_index()

1    4
2    1
3    5
4    3
5    2
6    6
dtype: int64

In [24]:
from pandas import DataFrame
data = {'Name':[3,23,2],
       'Age':[34,23,12],
       'Salary':[3000,4000,2500]}
frame = DataFrame(data)
frame

   Name  Age  Salary
0     3   34    3000
1    23   23    4000
2     2   12    2500

In [2]:
frame = frame.reindex([1,0,2])
frame

    Name  Age  Salary
1    Rob   23    4000
0   John   34    3000
2  Sansa   12    2500

In [3]:
frame.sort_index()

    Name  Age  Salary
0   John   34    3000
1    Rob   23    4000
2  Sansa   12    2500

In [5]:
frame2 = frame.reindex(columns=['Salary','Name','Age'])
frame2

   Salary   Name  Age
1    4000    Rob   23
0    3000   John   34
2    2500  Sansa   12

In [9]:
frame2 = frame2.sort_index(axis=1, ascending=False)
frame2

   Salary   Name  Age
1    4000    Rob   23
0    3000   John   34
2    2500  Sansa   12

In [11]:
ser.sort_values()

2    1
5    2
4    3
1    4
3    5
6    6
dtype: int64

In [12]:
frame2

   Salary   Name  Age
1    4000    Rob   23
0    3000   John   34
2    2500  Sansa   12

In [13]:
frame2.sort_values(by='Age')

   Salary   Name  Age
2    2500  Sansa   12
1    4000    Rob   23
0    3000   John   34

In [14]:
serie = Series([100,200,300],index=['a','b','b'])
serie

a    100
b    200
b    300
dtype: int64

In [15]:
serie.index.is_unique

False

In [17]:
frame2.sum()

Salary            9500
Name      RobJohnSansa
Age                 69
dtype: object

In [20]:
frame2.sum(axis=1)

1    4023
0    3034
2    2512
dtype: int64

In [26]:
frame.idxmax()

Name      1
Age       0
Salary    1
dtype: int64

In [27]:
frame.idxmin()

Name      2
Age       2
Salary    2
dtype: int64